{
  "backend/main.mo": "Main backend actor implementing employee management system with tasks, time tracking, messages, notifications, onboarding, work logs, and scheduling. Includes authorization and blob storage mixins with comprehensive data types and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping seven implemented features (authentication, dashboard, task management, time tracking, scheduling, messaging, onboarding) to their corresponding frontend files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, hooks, pages, and configuration for the employee task management application with authentication, task tracking, scheduling, and messaging features.",
  "frontend/index.css": "Tailwind CSS configuration with design tokens using OKLCH color space, defining light and dark theme variables for backgrounds, foregrounds, borders, and semantic colors with sidebar and chart color schemes.",
  "frontend/index.html": "HTML entry point for the Task Manager Employee App with viewport meta tag and root div mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication flow using Internet Identity, profile setup modal for new users, and route definitions for Dashboard, Tasks, TimeClock, Schedule, Messages, Profile, and Onboarding pages.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup collecting name, email, and employee ID with form validation and mutation handling using React Query.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing consistent structure with header, scrollable content area with container constraints, and fixed bottom mobile navigation.",
  "frontend/src/components/layout/Header.tsx": "Application header displaying app branding, notification bell icon with unread count badge, and logout button with Internet Identity integration.",
  "frontend/src/components/layout/MobileNavigation.tsx": "Fixed bottom navigation bar with six tabs (Home, Tasks, Clock, Schedule, Messages, Profile) using icons and active state highlighting for mobile-optimized navigation.",
  "frontend/src/components/tasks/TaskDetailDialog.tsx": "A dialog component for displaying and managing task details, including status updates, adding notes, and uploading images with progress tracking using ExternalBlob.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current user's profile from the backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login/logout functionality, delegation validation, and configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including tasks, user profiles, work logs, messages, notifications, and onboarding data with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, CSS custom properties for light/dark theme colors, and mobile-first accessibility styles including touch targets and font sizing.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying task statistics, quick navigation cards, and recent notifications with loading skeletons for the authenticated employee.",
  "frontend/src/pages/LoginPage.tsx": "Login page component with Internet Identity authentication button and branded card layout.",
  "frontend/src/pages/Messages.tsx": "Messages page component that displays an inbox of messages for an employee, allows viewing message details, and provides a reply interface with message type badges and timestamp display.",
  "frontend/src/pages/Onboarding.tsx": "Multi-step onboarding form component that collects personal info, employment details, and required documents (W4, I9, ID), converting files to ExternalBlob format before submission.",
  "frontend/src/pages/Profile.tsx": "Employee profile page that displays personal information (name, email, phone, address) and employment details (job title, company assignment) retrieved from user profile and employee data.",
  "frontend/src/pages/Schedule.tsx": "Schedule view component with daily and weekly tabs that displays tasks filtered by date, showing task status badges and location information for each scheduled task.",
  "frontend/src/pages/Tasks.tsx": "Task management page with tabbed filtering (all, pending, in-progress, completed) that displays task cards with status badges, notes count, and image count, opening a detail dialog on click.",
  "frontend/src/pages/TimeClock.tsx": "Time clock page component that displays current time, allows employees to clock in/out, and shows daily and weekly hours worked using work log data from backend queries.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations.",
  "project_state.json": "Project metadata defining a Task Manager Employee Mobile App as a React-based PWA with authentication, task management, time tracking, scheduling, messaging, and profile features with role-based access control."
}